app/Controllers/Registration.php

    public function index()
    {

        $curentPage = $this->request->getVar('page_antrian') ? $this->request->getVar('page_antrian') : 1;

        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $antrian = $this->antrianmodel->search($keyword);
        } else {
            $antrian = $this->antrianmodel;
        }

        $data = [
            'title' => 'Pendaftaran | BP Cindaga ',
            // 'antrian' => $this->antrianmodel->findAll()
            'antrian' => $this->antrianmodel->paginate(5, 'antrian'),
---
SELECT *
FROM `antrian`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `antrian`